Repository: maxgobeil/titan-parking
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: In the event of any dispute or complaint regarding our services, the client agrees to notify Titan Parking in writing within 5 business days of service completion. We will respond within 48 hours and make reasonable efforts to address valid concerns. Before initiating any legal action, both parties agree to attempt resolution through direct negotiation and, if necessary, mediation through a mutually agreed-upon third party in Quebec.
fr: En cas de litige ou de plainte concernant nos services, le client accepte d'en informer Titan Parking par écrit dans les 5 jours ouvrables suivant l'achèvement du service. Nous répondrons dans les 48 heures et ferons des efforts raisonnables pour répondre aux préoccupations. Avant d'entreprendre toute action en justice, les deux parties acceptent de tenter une résolution par négociation directe et, si nécessaire, par médiation via un tiers (mutuellement accepté) au Québec.

source: Quebec Civil Code Compliance
fr: Conformité au Code civil du Québec

source: This agreement is governed by the laws of Quebec, including the Quebec Civil Code. In accordance with Quebec law, our services aim to comply with all applicable provincial regulations, including those related to accessibility and safety markings. While we strive to provide services that meet all regulatory requirements, the client acknowledges their ultimate responsibility for ensuring their property complies with current Quebec regulations.
fr: Cette entente est régie par les lois du Québec, incluant le Code civil du Québec. Conformément à la loi québécoise, nos services visent à respecter tous les règlements provinciaux applicables, y compris ceux liés à l'accessibilité et aux marquages de sécurité. Bien que nous nous efforcions de fournir des services qui répondent à toutes les exigences réglementaires, le client reconnaît sa responsabilité ultime de s'assurer que sa propriété est conforme aux règlements québécois en vigueur.

source: Neither party shall be liable for any failure or delay in performing their obligations where such failure or delay results from any cause beyond the reasonable control of the party. Such causes include, but are not limited to: power failure, internet service provider failure, industrial action, civil unrest, fire, flood, storms, earthquakes, acts of terrorism, acts of war, governmental action, pandemic, or any other event beyond the control of the party in question. If affected by such an event, the affected party shall inform the other party as soon as reasonably possible and propose alternative dates for service.
fr: Aucune des parties ne sera tenue responsable de tout manquement ou retard dans l'exécution de ses obligations lorsque ce manquement ou ce retard résulte d'une cause hors du contrôle raisonnable de la partie. Ces causes comprennent, sans s'y limiter : panne de courant, défaillance du fournisseur de services Internet, action industrielle, troubles civils, incendies, inondations, tempêtes, tremblements de terre, actes de terrorisme, actes de guerre, action gouvernementale, pandémie, ou tout autre événement hors du contrôle de la partie en question. Si affectée par un tel événement, la partie touchée doit en informer l'autre partie dès que possible et proposer des dates alternatives pour le service.

source: Quality Commitment
fr: Engagement envers la qualité

source: Titan Parking is committed to providing the highest quality line striping services using professional equipment, premium materials, and experienced technicians. We stand behind our workmanship and aim to develop long-term relationships with our clients through superior service, reliability, and attention to detail. We recommend regular maintenance schedules to maximize the lifespan and appearance of your pavement markings.
fr: Titan Parking s'engage à fournir des services de traçage de lignes de la plus haute qualité en utilisant un équipement professionnel, des matériaux haut de gamme et des techniciens expérimentés. Nous garantissons notre travail et visons à développer des relations à long terme avec nos clients grâce à un service supérieur, une fiabilité et un soucis du détail. Nous recommandons des programmes d'entretien réguliers pour maximiser la durée de vie et l'apparence de vos marquages au sol.

source: Changes to These Terms
fr: Modifications de ces conditions

source: We reserve the right to modify these Terms at any time. Changes will be effective upon posting to our website. Your continued use of our services constitutes agreement to the modified Terms.
fr: Nous nous réservons le droit de modifier ces conditions à tout moment. Les modifications entreront en vigueur dès leur publication sur notre site web. Votre utilisation continue de nos services constitue une acceptation des conditions modifiées.

source: If you have any questions about these Terms, please contact us at:
fr: Si vous avez des questions concernant ces conditions, veuillez nous contacter à :

source: Phone:
fr: Téléphone :

source: Email:
fr: Courriel :

source: Based in Drummondville, serving the entire province of Quebec
fr: Basés à Drummondville, nous desservons toute la province de Québec

source: By signing below, you accept the terms of service and the quote #INV25-201
fr: En signant ci-dessous, vous acceptez ces conditions d'utilisation et la soumission #INV25-201.

source: English
fr: Anglais

source: French
fr: Français
