Repository: maxgobeil/titan-parking
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: Mobilization fees cover the transportation of equipment, materials, and crew to your location for a single scheduled visit. If our crew is unable to complete the work due to circumstances beyond our control (including but not limited to: vehicles parked in work areas, site not being ready as agreed, or client's failure to provide access), a second mobilization fee will be charged for any return visits required to complete the work.
fr: Les frais de déplacement couvrent le transport de l'équipement, du matériel et de l'équipe jusqu'à votre emplacement pour une seule visite planifiée. Si notre équipe ne peut pas terminer le travail en raison de circonstances indépendantes de notre volonté (incluant, mais sans s'y limiter: des véhicules stationnés dans les zones de travail, le site n'étant pas prêt comme convenu, ou l'impossibilité d'accéder au site), des frais de déplacement supplémentaires seront facturés pour chaque visite nécessaire à l'achèvement des travaux.

source: The client is responsible for ensuring that the work area is completely clear of vehicles during the scheduled service time. Any vehicles remaining in the designated work area will prevent us from completing that portion of the work. If the presence of vehicles prevents the completion of essential parts of the project, we may need to reschedule, resulting in additional mobilization charges.
fr: Le client est responsable de s'assurer que la zone de travail est complètement libre de véhicules pendant la période où les travaux seront exécutés. Tout véhicule restant dans la zone de travail désignée nous empêchera de compléter cette partie du travail. Si la présence de véhicules empêche l'achèvement des parties essentielles du projet, nous devrons peut-être reporter les travaux, ce qui entraînera des frais de déplacement supplémentaires.

source: Weather Conditions and Scheduling
fr: Conditions météorologiques et planification

source: Line striping and pavement marking are weather-dependent services. We reserve the right to reschedule work due to unsuitable weather conditions (rain, snow, temperatures below 10°C (50°F), or excessively high humidity). We will make reasonable efforts to accommodate your schedule when rescheduling is necessary.
fr: Le traçage de lignes et le marquage de chaussée sont des services qui dépendent des conditions météorologiques. Nous nous réservons le droit de reporter les travaux en cas de conditions météorologiques défavorables (pluie, neige, températures inférieures à 10°C (50°F) ou humidité excessive). Nous ferons des efforts considérables pour accommoder votre horaire lorsqu'une reprogrammation est nécessaire.

source: Surface Preparation
fr: Préparation de la surface

source: The client is responsible for ensuring that the surface is clean, dry, and in suitable condition for line striping at the time of our scheduled arrival. Any cleaning services agreed upon will be specified in the original quote.
fr: Le client est responsable de s'assurer que la surface est propre, sèche et dans un état approprié pour le traçage de lignes au moment de notre arrivée prévue. Tout service de nettoyage convenu sera spécifié dans la soumission initiale.

source: If surface conditions deteriorate between quote acceptance and service date (including but not limited to: new debris, dirt accumulation, or construction residue), additional cleaning may be required. Our crew will assess the surface condition upon arrival and make reasonable attempts to contact the client's designated representative regarding additional preparation needed.
fr: Si les conditions de surface se détériorent entre l'acceptation de la soumission et la date de service (incluant, mais sans s'y limiter : nouveaux débris, accumulation de saleté ou résidus de construction), un nettoyage supplémentaire pourrait être nécessaire. Notre équipe évaluera l'état de la surface à l'arrivée et fera des tentatives raisonnables pour contacter le représentant désigné du client concernant toute préparation supplémentaire nécessaire.

source: If we are unable to reach the client's representative at the time of service, and the condition of the surface would compromise the quality of our work, we reserve the right to either:
fr: Si nous ne parvenons pas à joindre le représentant du client au moment du service, et que l'état de la surface compromettrait la qualité de notre travail, nous nous réservons le droit soit de :

source: Proceed with necessary cleaning at the rates listed below, which will be added to the final invoice, or
fr: Procéder au nettoyage nécessaire aux tarifs indiqués ci-dessous, qui seront ajoutés à la facture finale, ou

source: Reschedule the service, which may result in additional mobilization fees as outlined in Section 4.
fr: Reporter le service, ce qui peut entraîner des frais de déplacement supplémentaires comme indiqué dans la Section 4.

source: Additional surface preparation services will be charged at the following rates:
fr: Les services de préparation de surface supplémentaires seront facturés aux tarifs suivants :

source: Debris removal or additional sweeping: $125/hour
fr: Enlèvement des débris ou balayage supplémentaire : 125$/heure.

source: Spot cleaning of stains or spills: $75 per area
fr: Nettoyage ponctuel des taches ou déversements : 75$ par zone.

source: Construction debris removal: $150/hour
fr: Enlèvement des débris de construction : 150$/heure.

source: A minimum one-hour charge applies to all additional services. These rates are subject to change and may vary based on specific site conditions.
fr: Un minimum d'une heure est facturé pour tous les services supplémentaires. Ces tarifs sont sujets à changement et peuvent varier selon les conditions spécifiques du site.

source: Cancellation Policy
fr: Politique d'annulation

source: If you need to cancel scheduled services:
fr: Si vous devez annuler des services programmés :

source: Cancellations made more than 48 hours before the scheduled start time: No cancellation fee
fr: Annulations effectuées plus de 48 heures avant l'heure de début prévue : Aucuns frais d'annulation.

source: If our crew arrives on site and cannot perform the scheduled work due to site conditions, vehicle obstruction, or lack of access, a full mobilization fee will be charged, and an additional mobilization fee will apply for any return visit to complete the work, as outlined in Section 4.
fr: Si notre équipe arrive sur place et ne peut pas effectuer les travaux prévus en raison des conditions du site, d'une obstruction par des véhicules ou d'un manque d'accès, des frais de déplacement complets seront facturés, et des frais de déplacement supplémentaires s'appliqueront pour toute visite de retour nécessaire pour compléter les travaux, comme indiqué dans la Section 4.

source: Warranty
fr: Garantie

source: We warrant our workmanship for a period of 90 days from the date of completion, under normal use conditions. This warranty is limited to the reapplication of markings that show premature wear or failure.
fr: Nous garantissons notre travail pour une période de 90 jours à compter de la date d'achèvement, dans des conditions d'utilisation normales. Cette garantie se limite à la réapplication des marquages qui montrent une usure ou une défaillance prématurée.

source: This warranty does not cover:
fr: Cette garantie ne couvre pas :

source: Damage from snow plowing, chemical spills, or abrasive materials
fr: Les dommages causés par le déneigement, les déversements chimiques ou les matériaux abrasifs.

source: Normal wear and tear from vehicle traffic
fr: L'usure normale due à la circulation des véhicules.

source: Damage from improper surface preparation if not performed by us
fr: Les dommages causés par une mauvaise préparation de la surface si elle n'est pas effectuée par nous.

source: Fading due to UV exposure or harsh weather conditions
fr: La décoloration due à l'exposition aux UV ou aux conditions météorologiques extrêmes.

source: Liability Limitation and Property Indemnification
fr: Limitation de responsabilité et indemnisation des biens

source: Our maximum liability for any claim arising out of our services shall be limited to the amount paid for the services. We are not liable for any indirect, consequential, or incidental damages, including but not limited to loss of use or business interruption.
fr: Notre responsabilité maximale pour toute réclamation découlant de nos services sera limitée au montant payé pour les services. Nous ne sommes pas responsables des dommages indirects, consécutifs ou accessoires, y compris, mais sans s'y limiter, la perte d'usage ou l'interruption des activités commerciales.

source: While Titan Parking takes all reasonable precautions to prevent damage, we cannot be held responsible for damage to vehicles that remain in the work area after the client has been notified to clear the area. Similarly, we are not responsible for tracking of wet paint by pedestrians or vehicles that enter marked work areas despite caution signs and barriers. The client acknowledges responsibility for securing the work area against unauthorized entry during the paint curing period as instructed by our crew.
fr: Bien que Titan Parking prenne toutes les précautions raisonnables pour prévenir les dommages, nous ne pouvons être tenus responsables des dommages aux véhicules qui restent dans la zone de travail après que le client ait été informé de libérer la zone. De même, nous ne sommes pas responsables des traces de peinture fraîche laissées par les piétons ou les véhicules qui entrent dans les zones de travail fraîchement marquées malgré les panneaux d'avertissement et les barrières. Le client reconnaît sa responsabilité de sécuriser la zone de travail contre toute entrée non autorisée pendant la période de séchage de la peinture, selon les instructions de notre équipe.

source: Permits and Regulatory Compliance
fr: Permis et conformité réglementaire

source: The client is ultimately responsible for ensuring their property complies with all applicable regulations and standards, including but not limited to:
fr: Le client est ultimement responsable de s'assurer que sa propriété est conforme à tous les règlements et normes applicables, incluant, mais sans s'y limiter :

source: Local municipal codes and bylaws
fr: Les codes et règlements municipaux locaux.

source: Provincial regulations (including Quebec's Act to secure handicapped persons in the exercise of their rights)
fr: Les règlements provinciaux (incluant la Loi assurant l'exercice des droits des personnes handicapées du Québec).

source: Federal requirements (such as the Accessible Canada Act)
fr: Les exigences fédérales (comme la Loi canadienne sur l'accessibilité).

source: CSA B651 accessibility standards
fr: Les normes d'accessibilité CSA B651.

source: While Titan Parking strives to provide services that comply with industry standards and can offer guidance on regulatory requirements, we cannot guarantee or assume liability for compliance issues. The client is responsible for obtaining any necessary permits or approvals from authorities before work begins and assumes final responsibility for ensuring that their requested layout complies with all applicable regulations. Titan Parking cannot be held liable for non-compliance issues resulting from client-approved designs or layouts.
fr: Bien que Titan Parking s'efforce de fournir des services conformes aux normes de l'industrie et puisse offrir des conseils sur les exigences réglementaires, nous ne pouvons garantir ou assumer la responsabilité des problèmes de conformité. Le client est responsable d'obtenir tous les permis ou approbations nécessaires auprès des autorités avant le début des travaux et assume la responsabilité finale de s'assurer que l'aménagement demandé est conforme à tous les règlements applicables. Titan Parking ne peut être tenu responsable des problèmes de non-conformité résultant de conceptions ou d'aménagements approuvés par le client.

source: Minimum Service Requirements
fr: Exigences minimales de service

source: Titan Parking maintains a minimum job size requirement of $850 per service call. Projects quoted below this amount will be subject to additional fees to meet this minimum threshold. This minimum reflects the cost of mobilization, equipment setup, and efficient resource allocation required to provide our professional services.
fr: Titan Parking exige un montant minimal de travail de 850$ par appel de service. Les projets dont la soumission est inférieure à ce montant seront soumis à des frais supplémentaires pour atteindre ce seuil minimal. Ce minimum reflète le coût de la mobilisation, de la mise en place de l'équipement et de l'allocation efficace des ressources nécessaires pour fournir nos services professionnels.

source: Materials and Quality Assurance
fr: Matériaux et assurance qualité

source: Titan Parking selects the most appropriate high-quality marking materials based on the specific requirements of each project. Our options include:
fr: Titan Parking utilisent les matériaux de marquage de haute qualité les plus appropriés en fonction des exigences spécifiques de chaque projet. Nos options incluent :

source: Water-based traffic paint (more environmentally friendly)
fr: Peinture de signalisation à base d'eau (plus écologique).

source: Oil-based traffic paint (recommended for high-traffic areas)
fr: Peinture de signalisation à base d'huile (recommandée pour les zones à forte circulation).

source: Epoxy coatings (recommended for interior applications such as warehouses and garages)
fr: Revêtements époxy (recommandés pour les applications intérieures comme les entrepôts et les garages).

source: Specialized materials for custom requirements
fr: Matériaux spécialisés pour les projets personnalisés.

source: The selection of materials will be determined based on factors including surface type, location (interior/exterior), expected traffic volume, weather exposure, and desired longevity. We will recommend the optimal solution for your specific situation, and material specifications will be detailed in your quote. Premium options or specialized applications may be available at additional cost for projects requiring extended durability or specific performance characteristics.
fr: Le choix des matériaux sera déterminé en fonction de facteurs incluant le type de surface, l'emplacement (intérieur/extérieur), le volume de circulation prévu, l'exposition aux intempéries et la longévité souhaitée. Nous recommanderons la solution optimale pour votre situation spécifique, et les spécifications des matériaux seront détaillées dans votre soumission. Des options premium ou des applications spécialisées peuvent être disponibles moyennant un coût supplémentaire pour les projets nécessitant une durabilité prolongée ou des caractéristiques de performance spécifiques.

source: Photography and Marketing
fr: Photographie et marketing

source: Titan Parking may document completed work through photography for quality assurance purposes. Unless otherwise specified by the client, we reserve the right to use these images for marketing and portfolio purposes. Client identification information will not be shared without permission. Upon request, these photos can be provided to the client for their records.
fr: Titan Parking peut documenter les travaux terminés par des photographies à des fins d'assurance qualité. Sauf indication contraire du client, nous nous réservons le droit d'utiliser ces images à des fins de marketing et de portfolio. Les informations d'identification du client ne seront pas partagées sans permission. Sur demande, ces photos peuvent être fournies au client pour ses dossiers.

source: Insurance Coverage
fr: Couverture d'assurance

source: Titan Parking maintains comprehensive commercial general liability insurance to protect both our business and our clients. Upon request, we can provide a Certificate of Insurance prior to commencing work. Our insurance covers potential property damage that may occur during the execution of our services, but does not extend to pre-existing property conditions or damage caused by third parties after completion of our work.
fr: Titan Parking possède une assurance responsabilité civile commerciale pour protéger à la fois notre entreprise et nos clients. Sur demande, nous pouvons fournir un certificat d'assurance avant de commencer les travaux. Notre assurance couvre les dommages potentiels aux biens qui peuvent survenir pendant l'exécution de nos services, mais ne s'étend pas aux conditions préexistantes des biens ou aux dommages causés par des tiers après l'achèvement de nos travaux.

source: Completed Work Acceptance
fr: Acceptation des travaux terminés

source: Upon completion of the work, the client will be given the opportunity to inspect the work performed. Unless the client notifies Titan Parking of any deficiencies within 48 hours of job completion, the work shall be deemed accepted. For jobs completed during non-business hours, photos of completed work will be provided, and the same 48-hour inspection period applies from the time the photos are delivered.
fr: À l'achèvement des travaux, le client aura l'opportunité d'inspecter le travail effectué. À moins que le client n'avise Titan Parking de toute déficience dans les 48 heures suivant l'achèvement des travaux, le travail sera considéré comme accepté. Pour les travaux terminés en dehors des heures ouvrables, des photos des travaux terminés seront fournies, et la même période d'inspection de 48 heures s'appliquera à partir du moment où les photos seront envoyées.

source: Documentation and Records
fr: Documentation et registres

source: Upon request, we will provide clients with documentation regarding work performed, including before and after photos, materials used, and appropriate maintenance recommendations. Clients should maintain these records for warranty purposes and future reference. For commercial properties subject to accessibility audits or insurance inspections, this documentation may serve as proof of compliance with current standards at the time of service.
fr: Sur demande, nous fournirons aux clients la documentation concernant les travaux effectués, y compris les photos avant et après, les matériaux utilisés et les recommandations d'entretien appropriées. Les clients doivent conserver ces documents à des fins de garantie et de référence future. Pour les propriétés commerciales soumises à des audits d'accessibilité ou des inspections d'assurance, cette documentation peut servir de preuve de conformité aux normes en vigueur au moment du service.

source: Equipment Failure and Technical Issues
fr: PBris d'équipement et problèmes techniques

source: In the rare event that Titan Parking experiences equipment failure or technical issues during service that prevent us from completing the scheduled work, we will take the following steps:
fr: Dans le rare cas où Titan Parking rencontre un bris d'équipement ou des problèmes techniques pendant le service qui nous empêchent de terminer les travaux prévus, nous prendrons les mesures suivantes :

source: Immediately notify the client's designated representative about the issue
fr: Aviser immédiatement le représentant désigné du client du problème.

source: Complete as much of the work as possible with functioning equipment, if applicable
fr: Compléter autant de travail que possible avec l'équipement fonctionnel, si applicable.

source: Reschedule the remaining work for the earliest available date
fr: Reprogrammer les travaux restants à la première date disponible.

source: No additional mobilization fee will be charged for the return visit to complete work that could not be completed due to our equipment failure
fr: Aucun frais de déplacement supplémentaire ne sera facturé pour la visite de retour pour compléter les travaux qui n'ont pu être terminés en raison de notre bris d'équipement ou problèmes techniques.

source: If equipment failure occurs before arriving at the job site and causes us to cancel the scheduled service, we will notify the client as soon as possible and reschedule the work at no additional charge. If the delay caused by equipment failure significantly impacts the client's operations or schedule, we will talk with the client to discuss a mutually agreeable solution.
fr: Si un bris d'équipement survient avant l'arrivée sur le site de travail et nous oblige à annuler le service prévu, nous en informerons le client dès que possible et reprogrammerons les travaux sans frais supplémentaires. Si le retard causé par le bris d'équipement affecte significativement les opérations ou l'horaire du client, nous discuterons avec le client pour trouver une solution mutuellement acceptable.

source: Titan Parking maintains all equipment according to manufacturer specifications and carries backup equipment for critical components to minimize the possibility of service interruptions. However, we acknowledge that mechanical issues may occasionally arise despite our best preventative efforts.
fr: Titan Parking entretient tout l'équipement selon les spécifications du fabricant et dispose d'équipement de secours pour les composants critiques afin de minimiser la possibilité d'interruptions de service. Cependant, nous reconnaissons que des problèmes mécaniques peuvent occasionnellement survenir malgré nos meilleurs efforts préventifs.

source: Equipment and Property Protection
fr: Protection de l'équipement et de la propriété

source: The client agrees to take reasonable precautions to protect Titan Parking's equipment and personnel while on the client's property. This includes ensuring safe access to work areas, providing notice of any known hazards, and preventing unauthorized persons from interfering with our work. Clients are responsible for communicating with their tenants, employees, or customers regarding the scheduled work to minimize disruptions and potential conflicts.
fr: Le client accepte de prendre des précautions raisonnables pour protéger l'équipement et le personnel de Titan Parking lorsqu'ils sont sur la propriété du client. Cela inclut d'assurer un accès sécuritaire aux zones de travail, d'informer de tout danger connu, et d'empêcher les personnes non autorisées d'interférer avec notre travail. Les clients sont responsables de communiquer avec leurs locataires, employés ou clients concernant les travaux prévus pour minimiser les perturbations et les conflits potentiels.

source: Communication and Project Management
fr: Communication et gestion de projet

source: The client agrees to designate a primary contact person who has authority to make decisions regarding the project. This person should be available during the scheduled work period either on-site or by phone. Titan Parking will provide updates on project status, any issues encountered, and expected completion times. We request that any changes to project scope or specifications be made in writing to avoid misunderstandings.
fr: Le client accepte de désigner une personne-ressource principale qui a l'autorité de prendre des décisions concernant le projet. Cette personne doit être disponible pendant la période de travail prévue, soit sur place soit par téléphone. Titan Parking fournira des mises à jour sur l'état du projet, les problèmes rencontrés et les temps d'achèvement prévus. Nous demandons que tout changement à la portée ou aux spécifications du projet soit fait par écrit pour éviter les malentendus.

source: Dispute Resolution
fr: Résolution des différends
